In [16]:
import pandas as pd
import json
import os

fp = os.getcwd()

# CSV

#### Read

In [17]:
df = pd.read_csv(fp + r"\data\Input\transfermarkt_values.csv", sep=";")
del df["Unnamed: 5"]

df.head(2)

   id first_name last_name  age        value
0   1     Kylian    Mbappe   23  160.000.000
1   2     Erling   Haaland   21    150000000

#### Write

In [18]:
df.to_csv(fp + r"\data\Output\transfermarkt_values.csv", sep=";", index=False)

# Json

#### Read (easier to load first...)

In [19]:
with open(fp + r"\data\Input\transfermarkt_values.json", "r") as f:
     df = pd.DataFrame(json.load(f))

df.head(2)

   id first_name last_name  age      value
0   1     Kylian    Mbappe   23  160000000
1   2     Erling   Haaland   21  150000000

#### Write

In [20]:
df.to_json(fp + r"\data\Output\transfermarkt_values.json")

# Excel

#### Read

In [21]:
df = pd.read_excel(fp + r"\data\Input\transfermarkt_values.xlsx", engine="openpyxl")

df.head(2)

   id first_name last_name  age      value
0   1     Kylian    Mbappe   23  160000000
1   2     Erling   Haaland   21  150000000

In [22]:
df.to_excel(fp + r"\data\Output\transfermarkt_values.xlsx", index=False)

# SQL

#### Read (pandas recommends sqlalchemy as con)

In [23]:
import sqlalchemy as db

engine = db.create_engine(f"mysql://root:root@localhost:3306/db")
df = pd.read_sql_query("SELECT * FROM users", engine)

df.head(2)

   id first_name last_name
0   1        Joe     Biden
1   2     Dieter    Bohlen

#### Write

In [ ]:
df.to_sql("users_pandas", engine, if_exists="fail")

12